НВ_Доработки/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПеремещениеТоваров</Name>
		</Properties>
		<ChildObjects>
		
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type><v8:Type>cfg:CatalogRef.Пользователи</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type><v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеТоваров</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидПеремещения</Name>
					<Type><v8:Type>cfg:CatalogRef.ВидыПеремещений</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОтправлено</Name>
					<Type><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПолучено</Name>
					<Type><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСобрано</Name>
					<Type><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>0</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type><v8:Type>cfg:DocumentRef.Монтаж</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type><v8:Type>cfg:CatalogRef.Организации</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type><v8:Type>cfg:DocumentRef.Монтаж</v8:Type><v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type><v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type><v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отправлено</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленоДата</Name>
					<Type><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленоОтветственный</Name>
					<Type><v8:Type>cfg:CatalogRef.Пользователи</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получено</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПолученоДата</Name>
					<Type><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПолученоОтветственный</Name>
					<Type><v8:Type>cfg:CatalogRef.Пользователи</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладОтправитель</Name>
					<Type><v8:Type>cfg:CatalogRef.Склады</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладПолучатель</Name>
					<Type><v8:Type>cfg:CatalogRef.Склады</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СозданПриИспользованииСтатусовПеремещений</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТекущийСтатус</Name>
					<Type><v8:Type>cfg:EnumRef.СтатусыПеремещений</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_ТаблицаНазначения</Name>
					<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>20</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПеремещения</Name>
					<Type><v8:Type>cfg:CatalogRef.ТипыПеремещений</v8:Type></Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type><v8:Type>cfg:CatalogRef.Номенклатура</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type><v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СерияНоменклатуры</Name>
							<Type><v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЯчейкаОтправитель</Name>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>50</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЯчейкаПолучатель</Name>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>50</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЕдиницаИзмерения</Name>
							<Type><v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type><v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Коэффициент</Name>
							<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>4</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>2</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Заказ</Name>
							<Type><v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type></Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТаблицаНазначения</Name>
							<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>20</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

НВ_Доработки/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/Documents/ПеремещениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
//++ НВД: колонки «Остаток (получатель)» и «Доступно (получатель)» в ТЧ Товары —
// остатки и доступность по складу-получателю (типовые колонки считаются по складу-отправителю).

&НаСервере
&После("ЗаполнитьОстаткиПоТоварам")
Процедура НВД_ЗаполнитьОстаткиПоТоварамПосле()

	НВД_ЗаполнитьОстаткиПоПолучателю();

КонецПроцедуры

&НаКлиенте
&После("СкладПолучательПриИзменении")
Процедура НВД_СкладПолучательПриИзмененииПосле(Элемент)

	НВД_ЗаполнитьОстаткиПоПолучателю();

КонецПроцедуры

&НаСервере
Процедура НВД_ЗаполнитьОстаткиПоПолучателю()

	Если НЕ ЗначениеЗаполнено(Объект.СкладПолучатель) Тогда
		Для Каждого СтрокаТоваров Из Объект.Товары Цикл
			СтрокаТоваров.НВД_ОстатокПолучателя = 0;
			СтрокаТоваров.НВД_ДоступноПолучателя = 0;
		КонецЦикла;
		Возврат;
	КонецЕсли;

	ДатаОстатков = ?(НЕ Объект.Ссылка.Пустая(), Объект.Дата, ТекущаяДатаСеанса());

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДокумента",			Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Организация",				Объект.Организация);
	Запрос.УстановитьПараметр("Склад",						Объект.СкладПолучатель);
	Запрос.УстановитьПараметр("ИспользуютсяОбщиеСклады",	Константы.ОбщиеСклады.Получить());
	Запрос.УстановитьПараметр("ИспользоватьРезервирование",	ПолучитьФункциональнуюОпцию("ИспользоватьРезервирование"));
	Запрос.УстановитьПараметр("ДатаГраница",				Новый Граница(ДатаОстатков, ВидГраницы.Исключая));

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗ_ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТЗ_ТаблицаДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТЗ_ТаблицаДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТЗ_ТаблицаДокумента.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ ВремТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТЗ_ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВремТаблицаДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВремТаблицаДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВремТаблицаДокумента.Коэффициент <> 0
	|			ТОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) / ВремТаблицаДокумента.Коэффициент
	|		ИНАЧЕ ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)
	|	КОНЕЦ КАК ОстатокНаСкладе,
	|	ВЫБОР
	|		КОГДА &ИспользоватьРезервирование
	|			ТОГДА ВЫБОР
	|					КОГДА ВремТаблицаДокумента.Коэффициент <> 0
	|						ТОГДА ЕСТЬNULL(ВРезервеОстатки.КоличествоОстаток, 0) / ВремТаблицаДокумента.Коэффициент
	|					ИНАЧЕ ЕСТЬNULL(ВРезервеОстатки.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВРезерве
	|ИЗ
	|	ВремТаблицаДокумента КАК ВремТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&ДатаГраница,
	|				ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ
	|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО ВремТаблицаДокумента.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВремТаблицаДокумента.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И ВремТаблицаДокумента.СерияНоменклатуры = ТоварыНаСкладахОстатки.СерияНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				&ДатаГраница,
	|				Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ИспользуютсяОбщиеСклады
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Организация = &Организация
	|					КОНЕЦ) КАК ВРезервеОстатки
	|		ПО ВремТаблицаДокумента.Номенклатура = ВРезервеОстатки.Номенклатура
	|			И ВремТаблицаДокумента.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры
	|			И ВремТаблицаДокумента.СерияНоменклатуры = ВРезервеОстатки.СерияНоменклатуры";

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл

		Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры");
		ЗаполнитьЗначенияСвойств(Отбор, ТекущаяСтрока);

		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОстатокПолучателя = НайденныеСтроки[0].ОстатокНаСкладе;
			РезервПолучателя = НайденныеСтроки[0].ВРезерве;
		Иначе
			ОстатокПолучателя = 0;
			РезервПолучателя = 0;
		КонецЕсли;

		ТекущаяСтрока.НВД_ОстатокПолучателя = ОстатокПолучателя;
		ТекущаяСтрока.НВД_ДоступноПолучателя = ОстатокПолучателя - РезервПолучателя;

	КонецЦикла;

КонецПроцедуры
